# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [69]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [70]:
ser1 = pd.Series(np.random.randint(1,4, size = 100))
ser2 = pd.Series(np.random.randint(1,3, size = 100))
ser3 = pd.Series(np.random.randint(10000, 30000, size= 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [71]:
df = pd.DataFrame({"x":ser1,"y":ser2,"z":ser3})
df

    x  y      z
0   1  2  16925
1   3  2  17194
2   2  1  24515
3   3  2  18324
4   3  1  13067
.. .. ..    ...
95  2  2  22889
96  1  2  15725
97  1  1  28459
98  1  2  26342
99  2  1  27841

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [72]:
housing = df.rename(columns={"x": "bedrs", "y": "bathrs", "z":"price_sqr_meter"})
housing

    bedrs  bathrs  price_sqr_meter
0       1       2            16925
1       3       2            17194
2       2       1            24515
3       3       2            18324
4       3       1            13067
..    ...     ...              ...
95      2       2            22889
96      1       2            15725
97      1       1            28459
98      1       2            26342
99      2       1            27841

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [73]:
bigcolumn = pd.concat([ser1, ser2, ser3], axis= 0)
bigcolumn.to_frame()

        0
0       1
1       3
2       2
3       3
4       3
..    ...
95  22889
96  15725
97  28459
98  26342
99  27841

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [74]:
bigcolumn.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99,  0,  1,
        2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52,
       53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
       70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
       87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99,  0,  1,  2,  3,
        4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
       21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
       38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54,
       55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
       72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88,
       89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], dtype=int64)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [77]:
bigcolumn.reset_index(drop=True)
bigcolumn.to_frame()

        0
0       1
1       3
2       2
3       3
4       3
..    ...
95  22889
96  15725
97  28459
98  26342
99  27841

[300 rows x 1 columns]